newwms_gift/src/Documents/ит_WMS_ТоварыВПути/ит_WMS_ТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ит_WMS_ТоварыВПути</name>
  <comment>Перевыпуск старого механизма под управляемые формы</comment>
  <registerRecords>AccumulationRegister.итТоварыВПути</registerRecords>
  <attributes>
    <name>ДатаВходящего</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_Входящего</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОприходования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПриемки</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.ит_WMS_СтатусыТоваровВПути</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДанныхВходящего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторТоварныхПозиций</name>
      <type>
        <types>CatalogRef.итИндентификаторыТоварныхПозиций</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/AccumulationRegisters/итТоварыВПути/итТоварыВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>итТоварыВПути</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

newwms_gift/src/Enums/ит_WMS_СтатусыТоваровВПути/ит_WMS_СтатусыТоваровВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ит_WMS_СтатусыТоваровВПути</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/ит_WMS_ТоварыВПути/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 
		ПередЗаписьПроведение(Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда 
		ПередЗаписьОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьПроведение(Отказ, РежимЗаписи, РежимПроведения)
	Если ДокументПоступления.Проведен Тогда 
		СтатусДокумента=Перечисления.ит_WMS_СтатусыТоваровВПути.Принят;
	иначе
		СтатусДокумента=Перечисления.ит_WMS_СтатусыТоваровВПути.ВПути;
	КонецЕсли;
	Если не ДокументПриемки.Пустая()  Тогда 
		ДатаОприходования=ДокументПриемки.ДатаЗавершенияДокумента;
	ИначеЕсли не ДокументПоступления.Пустая() Тогда 
		ДатаОприходования=ДокументПоступления.Дата;
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписьОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	СтатусДокумента= Перечисления.ит_WMS_СтатусыТоваровВПути.Создан;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьБлокировкиДанныхИОчиститьРегистры();
	НаборЗаписей=РегистрыНакопления.итТоварыВПути.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Если СтатусДокумента=Перечисления.ит_WMS_СтатусыТоваровВПути.ВПути или СтатусДокумента=Перечисления.ит_WMS_СтатусыТоваровВПути.Принят Тогда
		Для Каждого стр из Товары Цикл 
			НоваяЗапись=НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
			НоваяЗапись.Поставщик=Поставщик;
			НоваяЗапись.Номенклатура= стр.Номенклатура;
			НоваяЗапись.Период=Дата;
			НоваяЗапись.Регистратор=Ссылка;
			НоваяЗапись.ДатаРозлива=стр.ДатаРозлива;
			НоваяЗапись.Количество=стр.Количество;
			НоваяЗапись.Сумма=стр.СуммаВсего;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если СтатусДокумента=Перечисления.ит_WMS_СтатусыТоваровВПути.Принят Тогда
		Для Каждого стр из Товары Цикл 
			НоваяЗапись=НаборЗаписей.Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
			НоваяЗапись.Поставщик=Поставщик;
			НоваяЗапись.Номенклатура= стр.Номенклатура;
			НоваяЗапись.Период=Дата;
			НоваяЗапись.Регистратор=Ссылка;
			НоваяЗапись.ДатаРозлива=стр.ДатаРозлива;
			НоваяЗапись.Количество=стр.Количество;
			НоваяЗапись.Сумма=стр.СуммаВсего;
		КонецЦикла;
	КонецЕсли;
	НаборЗаписей.Записать();


КонецПроцедуры

Процедура УстановитьБлокировкиДанныхИОчиститьРегистры()
	БлокировкаДанных = новый БлокировкаДанных;
	
	СтруктураПараметров=итWMSСлужебныеПроцедурыИФункции.СоздатьСтруктуруПараметровБлокировкиДанных(Товары,БлокировкаДанных);
	СтруктураПараметров.ПолеПространствоБлокировок="Номенклатура,ДатаРозлива";
	СтруктураПараметров.ПолеИсточника="Номенклатура,ДатаРозлива";
	СтруктураПараметров.ПространствоБлокировки="РегистрНакопления.итТоварыВПути";
	итWMSСлужебныеПроцедурыИФункции.УстановкаЭлементаБлокировокДанныхWMS(СтруктураПараметров);
	
	
	БлокировкаДанных.Заблокировать();
		
	НаборЗаписей=РегистрыНакопления.итТоварыВПути.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	
КонецПроцедуры
